# Brewfile for macOS setup
# Install with: brew bundle

# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Core utilities
brew "git"
brew "curl"
brew "wget"
brew "tree"
brew "htop"
brew "jq"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"  # Modern ls replacement
brew "zoxide"  # Smarter cd command
brew "tmux"
brew "neovim"

# Development tools
brew "node"
brew "python"
brew "go"
brew "rust"
brew "docker"
brew "docker-compose"

# CLI productivity
brew "fzf"
brew "gh"  # GitHub CLI
brew "lazygit"
brew "tldr"

# Applications (Casks)
cask "ghostty"
cask "claude"
cask "visual-studio-code"
cask "iterm2"  # Alternative to Ghostty
cask "rectangle"  # Window management
cask "alfred"  # Spotlight replacement
cask "1password"
cask "spotify"
cask "slack"
cask "discord"
cask "notion"
cask "obsidian"
cask "raycast"  # Alternative to Alfred

# Fonts
cask "font-jetbrains-mono"
cask "font-fira-code"
cask "font-cascadia-code"

# Mac App Store apps (requires mas)
brew "mas"
# mas "Xcode", id: 497799835
# mas "Amphetamine", id: 937984704  # Keep Mac awake
# mas "Hidden Bar", id: 1452453066  # Menu bar management