# Brewfile for macOS setup
# Install with: brew bundle

# Taps
# Note: homebrew/cask is now built-in
# Note: fonts are now in homebrew/cask, no separate tap needed

# Core utilities
brew "git"
brew "curl"
brew "wget"
brew "tree"
brew "htop"
brew "jq"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"  # Modern ls replacement
brew "zoxide"  # Smarter cd command
brew "tmux"
brew "neovim"
brew "watch"
brew "emacs"
brew "libtool"  # GNU libtool, provides glibtool for building packages

# Development tools
brew "node"
brew "python"
brew "go"
brew "rust"
brew "cmake"
brew "qemu"
brew "uv"  # Fast Python package and project manager

# CLI productivity
brew "fzf"
brew "gh"  # GitHub CLI
brew "lazygit"
brew "tldr"

# Applications (Casks)
# Note: Docker Desktop requires sudo for installation, install manually:
# brew install --cask docker-desktop
cask "docker-desktop"  # Docker Desktop
cask "ghostty"
cask "claude"
cask "visual-studio-code"
cask "iterm2"  # Alternative to Ghostty
cask "rectangle"  # Window management
cask "alfred"  # Spotlight replacement
cask "1password"
cask "spotify"
cask "slack"
cask "discord"
cask "logseq"  # Privacy-first, local-first knowledge base
cask "tailscale"  # Zero config VPN
cask "syncthing"  # Continuous file synchronization

# Fonts
cask "font-jetbrains-mono"
cask "font-fira-code"
cask "font-cascadia-code"

# Mac App Store apps (requires mas)
brew "mas"
# mas "Xcode", id: 497799835
# mas "Amphetamine", id: 937984704  # Keep Mac awake
# mas "Hidden Bar", id: 1452453066  # Menu bar management
